Revit 2027 API
Application.NewIntersectionResultArray Method
Creates a new instance of an IntersectionResult array.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IntersectionResultArray NewIntersectionResultArray()
Public Function NewIntersectionResultArray As IntersectionResultArray
public:
IntersectionResultArray^ NewIntersectionResultArray()
member NewIntersectionResultArray : unit -> IntersectionResultArray
Return Value
IntersectionResultArray
See Also
Reference
Application Class
Autodesk.Revit.Creation Namespace